{"data":{"allYoutubeVideo":{"edges":[{"node":{"title":"Not Your Average Daily Dose Addiction","videoId":"DNtttERtm10","publishedAt":"2020-07-22T15:01:02Z","description":"","thumbnail":{"height":480,"url":"https://i.ytimg.com/vi/DNtttERtm10/sddefault.jpg","width":640}}},{"node":{"title":"Microlearning Explained","videoId":"rHoc9XzNx8s","publishedAt":"2020-07-14T13:58:02Z","description":"The Daily Dose provides 3-minute micro-documentary films delivered to your inbox daily: http://dailydosenow.com\n\nFollow us on social media: \nTwitter: https://twitter.com/TheDailyDose18\nFacebook: https://www.facebook.com/thedailydosenow","thumbnail":{"height":720,"url":"https://i.ytimg.com/vi/rHoc9XzNx8s/maxresdefault.jpg","width":1280}}},{"node":{"title":"Get Your Nerd On With The Daily Dose: Microlearning Films in 3-Minutes or Less","videoId":"xE29z4hztbs","publishedAt":"2020-07-05T20:49:45Z","description":"The Daily Dose provides 3-minute microlearning films delivered to your inbox daily: http://dailydosenow.com\n\nFollow us on social media: \nTwitter: https://twitter.com/TheDailyDose18\nFacebook: https://www.facebook.com/thedailydosenow","thumbnail":{"height":720,"url":"https://i.ytimg.com/vi/xE29z4hztbs/maxresdefault.jpg","width":1280}}},{"node":{"title":"Disneyland's Opening Day: A Shaky Grand Opening for the Happiest Place on Earth","videoId":"5O_O63UfFqE","publishedAt":"2020-05-31T07:00:02Z","description":"For episodes daily, please sign up: http://dailydosenow.com/\n\nToday's Daily Dose covers the grand opening of Disneyland in 1955, which proved to be anything but a smooth and problem-free first day of operations. The filmmaker has included the original voice-over script to further assist your understanding: \n\nToday on The Daily Dose, a shaky grand opening for the happiest place on earth.\n\nDisneyland was the result of Walt Disney’s vision to make a theme park that captured the illusionary wonders found in his movies, as well as a place where parents could have just as much fun as their children. Disney started planning his park in the 1940s, while his overriding theme had morphed several times before construction began in 1954. Originally, Disneyland was to be called Mickey Mouse Park, and if he had kept that vision for a mouse-centric experience, his final product would have been drastically different than the Disneyland we’ve come to know. Despite his evolving concepts for the park, in Disney’s mind, anyway, Disneyland had to be totally perfect, including no potential glimpses at building in the surrounding city of Anaheim that existed outside his theme park. In other words, Disney insisted that nothing should be allowed to break the magic and illusionary wonders he had set out to create.\n\nDisneyland opened on July 17, 1955, exactly one year and a day after construction first began. Opening day guests were by invitation only, including celebrities, press, friends, families and Disney VIPs. There was a total of around 11,000 invited guests, but the invitations themselves soon leaked to the outside world. Counterfeit tickets were sold illegally, and one man even set up a ladder and charged $5.00 a person for desperate would-be park-goers to scale the fence. Over 28,000 people entered Disneyland that day, a number that both Disneyland and the City of Anaheim were completely unprepared for. Traffic was backed up for several miles outside of the park, and the Disney parking lots soon reached capacity. Problems were magnified when a plumber’s strike turned off all the water to every drinking fountain on the unusually hot 100 plus degree day, while every Disneyland restaurant ran out of food and drinks within hours. The heat also made the freshly-laid masonry asphalt turn spongy, making walking particularly treacherous for women in high heels. Several of the rides malfunctioned, and a gas leak prompted Adventure Land, Frontier Land and Fantasy Land to be evacuated. \n\nDespite these opening day glitches, Disneyland would open to the general public the following day, welcoming upwards of 50,000 visitors into the park, who had begun amassing at the main gates as early as two AM in the morning. Within its first two months of operations, Disneyland proved to be an overwhelming success, welcoming more than a million visitors to the happiest place on earth.\n\nAnd there ‘ya have it, a shaky grand opening for Disneyland.","thumbnail":{"height":720,"url":"https://i.ytimg.com/vi/5O_O63UfFqE/maxresdefault.jpg","width":1280}}},{"node":{"title":"Bonus Army: The Expeditionary Forces of 1932","videoId":"G5462BvrUUw","publishedAt":"2020-07-08T07:00:07Z","description":"For more micro-documentaries like this delivered to your inbox daily, please sign up at http://dailydosenow.com\n\nToday's Daily Dose history short covers the Bonus Marchers of 1932, when World War One veterans marched on Washington, DC demanding early payment of their bonus money for their wartime sacrifices. The filmmaker has included the original voice over script to further assist your understanding: \n\nToday on The Daily Dose, The Bonus Expeditionary Forces of 1932.\n\nIn 1924, five years before the stock market crash of 1929 and the subsequent decade-long Great Depression, congress enacted the World War Adjusted Compensation Act, which awarded World War One veterans a certificate of payment not to be redeemed until 1948. When the Great Depression stripped many of these veterans of jobs and a roof over their heads, approximately 43,000 veterans and their families descended upon Washington DC to demonstrate for early payment of their certificates. Known as Bonus Marchers or the Bonus Expeditionary Forces, the protesters established a Hooverville or shantytown along the banks of the Anacostia River in central Washington.\n\nWhile many Americans unfairly blamed President Herbert Hoover for worsening the Great Depression through inadequate economic policy, on July 28th, he further tanked his reputation by ordering the Bonus Marchers forcefully removed from government land. In response, Army Chief of Staff General Douglas MacArthur and his subordinate understudies George S. Patton and Dwight D. Eisenhower led a contingent of 500 infantrymen and 500 cavalrymen, 6 M1917 light tanks and 800 policemen into the Bonus Marcher’s Hooverville, unleashing tear gas and fire arms when the protesters refused to leave their encampment. Just as the veterans had endured mustard gas attacks in the trenches of Europe, this time the gassing would be delivered by their own countrymen. Two veterans would die the next day from gunshot wounds received by over-zealous police officers, while a total of 1,017 veterans and their wives and children would be injured. Once the Bonus Marchers were successfully routed from their encampment, their dwellings and personal belongings were summarily burned to the ground.\n\nAfter news of the violence spread throughout the country, Americans were largely horrified by the violent treatment applied to these once heroic veterans of World War One, further eroding Hoover’s image as a compassionate leader. Three months later, he would be voted out of office when Franklin D. Roosevelt captured 57.4 percent of the popular vote, carrying 42 states and nearly 88 percent of the Electoral vote.\n\nAnd there ‘ya have it, The Bonus Expeditionary Forces of 1932.","thumbnail":{"height":480,"url":"https://i.ytimg.com/vi/G5462BvrUUw/sddefault.jpg","width":640}}},{"node":{"title":"Hoovervilles of the Great Depression","videoId":"EXgrmXeKjOU","publishedAt":"2020-06-24T07:00:04Z","description":"For more episodes, please visit http://dailydosenow.com\n\nToday's Daily Dose history short covers Hoovervilles of the Great Depression, when hundreds of thousands of unemployed and homeless Americans built shelters in shantytowns all over the nation. The filmmaker has included the original voice-over script to further assist your understanding: \n\nToday on The Daily Dose, Hoovervilles of the Great Depression.\n\nAt the height of the Great Depression, when one in four eligible workers found themselves homeless and unemployed, hundreds of shantytown slums sprang up across the nation, housing hundreds of thousands of destitute Americans. Disillusioned citizens called them Hoovervilles, referring to the commonly-held belief that Republican President Herbert Hoover was a do-nothing leader, who passed responsibility for the rampant homeless epidemic on to local governments and charities.\n\nHomelessness was certainly present long before the Great Depression, making the condition a common sight in most American cities well before the Black Tuesday stock market crash of 1929. Most cities built municipal lodging houses for their homeless, until the Great Depression exponentially increased demand for limited public housing. As a result, massive Hoovervilles formed near soup kitchens, usually trespassing on private lands, yet tolerated or ignored out of dire necessity. Some Hooverville residents possessed construction skills, allowing them to build their houses out of stone, but the vast majority resorted to building their residences out of wood from crates, cardboard, scraps of metal or whatever materials they could find.\n\nWhen a Hooverville formed near the Reservoir in New York’s Central Park, the residents were hastily evicted by the police. As the Depression wore on, however, public sentiment became more sympathetic, and in July 1931, a judge suspended the sentences of 22 unemployed men sleeping in Central Park, giving each of them two dollars out of his own pocket. “We work hard to keep clean,” one of the men said to the judge, “because that’s important. I never lived like this before.”\n\nIn 1932, Democratic Presidential candidate Franklin D. Roosevelt campaigned for the forgotten man at the bottom of the economic pyramid. After his election to the White House, at his direction, congress passed a series of emergency measures known as The New Deal for the American people, forging a new government agency known as the Works Progress Administration or WPA. The program would grow to employ 8.5 million people and spend over 11 billion dollars as it transformed the nation’s infrastructure by putting Americans back to work.\n\nAnd there ‘ya have it, Hoovervilles of the Great Depression, today on The Daily Dose.","thumbnail":{"height":720,"url":"https://i.ytimg.com/vi/EXgrmXeKjOU/maxresdefault.jpg","width":1280}}}]}}}